flit/argon-rtos/src/devices/MKL28T7/MKL28T7_CORE0.svd
                  <description>Bus master 19 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 19 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP20</name>
              <description>Process identifier present from bus master 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 20 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 20 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP21</name>
              <description>Process identifier present from bus master 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 21 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 21 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP22</name>
              <description>Process identifier present from bus master 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 22 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 22 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP23</name>
              <description>Process identifier present from bus master 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 23 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 23 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP24</name>
              <description>Process identifier present from bus master 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 24 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 24 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP25</name>
              <description>Process identifier present from bus master 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 25 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 25 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP26</name>
              <description>Process identifier present from bus master 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 26 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 26 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP27</name>
              <description>Process identifier present from bus master 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 27 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 27 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP28</name>
              <description>Process identifier present from bus master 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 28 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 28 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP29</name>
              <description>Process identifier present from bus master 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 29 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 29 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP30</name>
              <description>Process identifier present from bus master 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 30 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 30 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP31</name>
              <description>Process identifier present from bus master 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bus master 31 does not source a process identifier register. The XRDC_MDAC logic provides the needed PID for processor cores.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bus master 31 sources a process identifier register to the XRDC_MDAC logic.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
