flit/argon-rtos/src/devices/MKL28T7/MKL28T7_CORE0.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MU0_B</name>
      <description>MU</description>
      <groupName>MU</groupName>
      <prependToName>MU0_B_</prependToName>
      <baseAddress>0x400A3000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x68</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VER</name>
          <description>Version ID Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>TBD</description>
                  <value>#0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>TR%s</name>
          <description>Transmit Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Processor A/B Transmit Register Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>RR%s</name>
          <description>Receive Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Processor A/B Receive Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF00080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Fn</name>
              <description>For n = {0, 1, 2} Processor A/B Side Flag n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Processor B/A Fn bit in the CR register is written 0 (default).</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Processor B/A Fn bit in the CR register is written 1.</description>
                  <value>#001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NMIC</name>
              <description>Processor A/B Non-Maskable-Interrupt Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Default</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Writing &quot;1&quot; clears the NMI bit in the BCR register.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EP</name>
              <description>Processor A/B Side Event Pending</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The Processor A-side event is not pending (default).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The Processor A-side event is pending.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PM</name>
              <description>Processor B/A Power Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>The Processor B/A is in Run Mode.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>The Processor B/A is in WAIT Mode.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>The Processor B/A is in STOP/VLPS Mode.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>The Processor B/A is in LLS/VLLS Mode.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUP</name>
              <description>Processor A/B Flags Update Pending</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No flags updated, initiated by the Processor A, in progress (default)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Processor A/B initiated flags update, processing</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEn</name>
              <description>For n = {0, 1, 2, 3} Processor A/B Transmit Register n Empty</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Processor A/B TRn register is not empty.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Processor A/B TRn register is empty (default).</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFn</name>
              <description>For n = {0, 1, 2, 3} Processor A/B Receive Register n Full</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Processor A/B RRn register is not full (default).</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Processor A/B RRn register has received data from Processor B/A TRn register and is ready to be read by the Processor A/B.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIPn</name>
              <description>For n = {0, 1, 2, 3} Processor A/B General Interrupt Request n Pending</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Processor A/B general purpose interrupt n is not pending. (default)</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Processor A/B general purpose interrupt n is pending.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Fn</name>
              <description>For n = {0, 1, 2} Processor A/B to Processor B/A Flag n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clears the Fn bit in the SR register.</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Sets the Fn bit in the SR register.</description>
                  <value>#001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NMI</name>
              <description>Processor B/A Non-maskable Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Non-maskable interrupt is not issued to the Processor B/A by the Processor A/B (default).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Non-maskable interrupt is issued to the Processor B/A by the Processor A/B.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUR</name>
              <description>Processor A MU Reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>N/A. Self clearing bit (default).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Asserts the Processor A MU reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRSTH</name>
              <description>Processor B Reset Hold</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Release Processor B from reset</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Hold Processor B in reset</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKE</name>
              <description>Processor B/A clock enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Processor B/A platform clock gated when Processor B/A enters a stop mode.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Processor B/A platform clock kept running after Processor B/A enters a stop mode, until Processor A/B also enters a stop mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BBOOT</name>
              <description>Processor B Boot Config.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Boot from 0x0</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Boot from DMEM Base</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Boot from IMEM Base</description>
                  <value>#10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIRn</name>
              <description>For n = {0, 1, 2, 3} Processor A/B General Purpose Interrupt Request n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Processor A/B General Interrupt n is not requested to the Processor B/A (default).</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Processor A/B General Interrupt n is requested to the Processor B/A.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIEn</name>
              <description>For n = {0, 1, 2, 3} Processor A/B Transmit Interrupt Enable n</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables Processor A/B Transmit Interrupt n. (default)</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables Processor A/B Transmit Interrupt n.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RIEn</name>
              <description>For n = {0, 1, 2, 3} Processor A/B Receive Interrupt Enable n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables Processor A/B Receive Interrupt n. (default)</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables Processor A/B Receive Interrupt n.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIEn</name>
              <description>For n = {0, 1, 2, 3} Processor A/B General Purpose Interrupt Enable n</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables Processor A/B General Interrupt n. (default)</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables Processor A/B General Interrupt n.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
